In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
user_actions=pd.read_excel('user_actions.xlsx')

In [4]:
df = user_actions

In [5]:
df.head()

          ds  user_id action    extra
0 2019-01-06        3  login  desktop
1 2019-01-07        3   post  desktop
2 2019-01-08        7  login   mobile
3 2019-01-09        1  login  desktop
4 2019-01-06        2   post   mobile

In [7]:
df.describe(include='all')

                         ds    user_id action   extra
count                    21  21.000000     21      21
unique                    7        NaN      2       2
top     2019-01-07 00:00:00        NaN  login  mobile
freq                      5        NaN     15      13
first   2019-01-06 00:00:00        NaN    NaN     NaN
last    2019-01-12 00:00:00        NaN    NaN     NaN
mean                    NaN   4.857143    NaN     NaN
std                     NaN   2.372461    NaN     NaN
min                     NaN   1.000000    NaN     NaN
25%                     NaN   3.000000    NaN     NaN
50%                     NaN   6.000000    NaN     NaN
75%                     NaN   6.000000    NaN     NaN
max                     NaN  10.000000    NaN     NaN

In [16]:
df1=df[(df['extra']=='mobile') & (df['action']=='login')]

In [17]:
df1.head()

           ds  user_id action   extra
2  2019-01-08        7  login  mobile
13 2019-01-09        4  login  mobile
14 2019-01-06        6  login  mobile
15 2019-01-07        6  login  mobile
16 2019-01-08        6  login  mobile

In [19]:
count = df1['user_id'].nunique()

In [20]:
print(count)

3

In [21]:
df1.dtypes

ds         datetime64[ns]
user_id             int64
action             object
extra              object
dtype: object

In [22]:
df1['ds'].nunique()

7

In [81]:
x =df1.groupby('user_id')['ds'].nunique()==7

In [86]:
x[x==True].value_counts()[1]

1

In [85]:
x.value_counts()

False    2
True     1
Name: ds, dtype: int64

In [ ]:
df2=pd.DataFrame(df1.groupby('user_id')['ds'].nunique())

In [89]:
df2=pd.DataFrame(df1.groupby('user_id')['ds'].nunique())

In [91]:
df2=df2[df2['ds']==7]

In [92]:
df2

         ds
user_id
6         7

In [94]:
df2.columns

Index(['ds'], dtype='object')

In [95]:
df2.loc[].nunique()

SyntaxError: invalid syntax (<ipython-input-95-244ab0009b18>, line 1)